app/Controllers/Auth.php

SELECT *
FROM `usuario`
WHERE `usuario` = 'pepoo8'
 LIMIT 1
---
    public function login()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'usuario' => 'required',
            'clave'   => 'required'
        ];

        $messages = [
            'usuario' => [
                'required'    => 'El nombre de usuario es obligatorio.'
            ],
            'clave' => [
                'required'    => 'La contraseña es obligatoria.'
            ]
        ];

        if (!$this->validate($rules, $messages)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $usuarioModel = new usuarioModel();
        $session = session();

        $usuario = $this->request->getPost('usuario');
        $clave   = $this->request->getPost('clave');

        $data = $usuarioModel->where('usuario', $usuario)->first();