app/Controllers/Tareas.php

        public function index(){


            $userId = session()->get('id');

            if (!$userId) {
                return redirect()->to('auth/login');
            }

            $tareaModel = new TareaModel();
            $tareas = $tareaModel->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `tarea`
WHERE `id_usuario` = '3'

        public function misSubtareas(){

            $userId = session()->get('id');

            if (!$userId) {
                return redirect()->to('auth/login');
            }

            $db = \Config\Database::connect();

            $builder = $db->table('subtarea');
            $builder->select('subtarea.*');
            $builder->join('tarea', 'subtarea.id_tarea = tarea.id');
            $builder->where('tarea.id_usuario', $userId);

            $query = $builder->get();
---
SELECT `subtarea`.*
FROM `subtarea`
JOIN `tarea` ON `subtarea`.`id_tarea` = `tarea`.`id`
WHERE `tarea`.`id_usuario` = '2'