app/Controllers/Tareas.php

        public function cambiarEstado($id){

            $nuevoEstado = $this->request->getPost('estado');
            $tareaModel = new tareaModel();
            $subtareaModel = new subtareaModel();

            $tarea = $tareaModel->find($id);
            if (!$tarea) {
                return redirect()->back()->with('errors', ['general' => 'Tarea no encontrada']);
            }

            if ($tarea['estado'] === 'completada' && $nuevoEstado === 'en_proceso') {
                session()->set('show_modal_subtarea', true);
                session()->set('tarea_id', $id);
            }

            $tareaModel->update($id, ['estado' => $nuevoEstado]);
---
UPDATE `tarea` SET `asunto` = 'Viaje', `descripcion` = 'organizar mi viaje de negocios', `prioridad` = 'alta', `estado` = 'en_proceso', `fecha_vencimiento` = '2025-06-06', `fecha_recordatorio` = '2025-06-05'
WHERE `tarea`.`id` IN ('2')